import React, { Component } from "react";
import { Table } from "react-bootstrap";
import { englishToNepaliNumber } from "nepali-number";

const torList = [
  "प्रदेश स्तरमा पशु सेवा सम्बन्धी तालिम नीति,कार्यविधि,मापदण्ड तथा प्राविधिक नर्मस तर्जुमा गर्ने।",
  "तालिम आवश्यकता पहिचान (Training Need Assessment) गर्ने।",
  "तालिम सामग्री तयार गर्ने।",
  "तालिमको सञ्चालन र कार्ययोजना बनाउने।",
  "पशु सेवा सम्बन्धी समय सापेक्ष विभिन्न विषयगत तालिमको पाठ्यक्रम तयारी तथा परिमार्जन गर्ने।",
  "पशुपन्छी तथा मत्स्य सम्वन्धीउत्पादन, स्वास्थ्य, असल अभ्यासलगायत अन्य सम्बन्धीत विषयमा तालिम सञ्चालन गर्ने।",
  "कृषक÷उद्यमी,मध्यम तथा अधिकृत स्तरका कर्मचारीहरूका लागि ज्ञान,सीप तथा क्षमता अभिवृद्धि सम्बन्धी तालिम सञ्चालन गर्ने।",
  "सरकारी,गैरसरकारी एवं विदेशी सङ्घ संस्थाहरूसँग समन्वयमा तालिम सञ्चालन गर्ने।",
  "प्रविधि प्रसार सामग्री तयारी तथा वितरण गर्ने।",
  "तालिम प्रभावकारिता अध्ययन,अनुगमन तथा मूल्याङ्कन गर्ने र सोका आधारमा विषयगत तालिमहरूको सुधार परिमार्जन र खारेजीका लागि नीतिगत पृष्ठपोषण प्रदान गर्ने।",
  "तालिम आवश्यकता पहिचान र तालिम सञ्चालनका क्रममा पहिचान गरिएका पशुपन्छी तथा मत्स्य पालन सम्बन्धी समस्याहरूको अनुसन्धानका लागि सम्बन्धीत निकायहरूसँग समन्वय गर्ने र प्राप्त नतिजाको कृषकरउद्यमी स्तरमा प्रचार प्रसार गर्ने।",
  "विज्ञ केन्द्र तथा स्थानीय स्तरमा सञ्चालन हुने तालिमको पाठ्यक्रम विकास तथा निर्माणमा सहयोग गर्ने।",
  "तालिम लिएका तथा लिन बाँकी कृषक तथा प्राविधिकहरूको रेकर्ड राख्ने र सो तालिमको उचित रूपमा उपयोग भए नभएको बारे पृष्ठपोषण गर्ने ।",
  "प्रदेश सरकारबाट स्वीकृत तालिम सञ्चालन निर्देशिका २०७५ बमोजिम कार्य गर्ने।",
];

export class Tor extends Component {
  render() {
    return (
      <div className="content">
        <div className="titlebar">कार्यविवरण (TOR)</div>
        <Table
          responsive
          striped
          bordered
          hover
          className="border-1 border-radius-5"
        >
          <thead>
            <tr>
              <th>क्र.स.</th>

              <th>
                पशु सेवा तालिम केन्द्र पोखरा, गण्डकी प्रदेशको कार्यविवरण (TOR)
              </th>
            </tr>
          </thead>
          <tbody>
            {torList.map((tor, index) => (
              <tr>
                <td>{englishToNepaliNumber(index + 1)}</td>
                <td key={index}> {tor}</td>
              </tr>
            ))}
          </tbody>
        </Table>
      </div>
    );
  }
}

export default Tor;
