import React, { Component } from "react";
import Carousel from "react-bootstrap/Carousel";
import { Image } from "react-bootstrap";
import { Footer } from "../../components";

const imagelist = [
  {
    title: "पशु प्रजनन् तथा कृत्रिम गर्भाधान हाते पुस्तिका",
    description: "पशु प्रजनन् तथा कृत्रिम गर्भाधान हाते पुस्तिका",
    src: "/images/image4.jpg",
  },
  {
    title: "पशु प्रजनन् तथा कृत्रिम गर्भाधान हाते पुस्तिका",
    description: "पशु प्रजनन् तथा कृत्रिम गर्भाधान हाते पुस्तिका",
    src: "/images/image4.jpg",
  },
  {
    title: "पशु प्रजनन् तथा कृत्रिम गर्भाधान हाते पुस्तिका",
    description: "पशु प्रजनन् तथा कृत्रिम गर्भाधान हाते पुस्तिका",
    src: "/images/image4.jpg",
  },
  {
    title: "पशु प्रजनन् तथा कृत्रिम गर्भाधान हाते पुस्तिका",
    description: "पशु प्रजनन् तथा कृत्रिम गर्भाधान हाते पुस्तिका",
    src: "/images/image4.jpg",
  },
];

class Home extends Component {
  render() {
    return (
      <div className="content">
        <div className="titlebar">Home</div>
        <div className="sliderCard">
          <Carousel>
            {imagelist.map((image, index) => (
              <Carousel.Item>
                <Image
                  className="rounded"
                  src={image.src}
                  alt={image.title}
                  fluid
                />
                <Carousel.Caption>
                  <h3>{image.title}</h3>
                  <p>{image.description}</p>
                </Carousel.Caption>
              </Carousel.Item>
            ))}
          </Carousel>
        </div>
        <div className="subtitle mt-2">परिचय</div>
        <div className="card">
          वि.सं. २०५२ साल आषाढ महिनामा कृषि विकास विभागको संरचनामा परिवर्तन भइ
          पशु सेवा विभागको स्थापना पश्चात पशु सेवा तर्फको तालिम कार्यक्रमहरु
          सुचारु रुपले संचालन गर्न गराउनका लागि केन्द्रीय स्तरमा पशुसेवा तालिम
          तथा प्रसार निर्देशनालय र यस अन्तर्गत पाँचविकास क्षेत्रमा क्षेत्रीय पशु
          सेवा तालिम केन्द्रको स्थापना भएको थियो। जस मध्ये पश्चिमाञचल विकास
          क्षेत्रमा क्षेत्रीय पशु सेवा तालिम केन्द्र, पोखरा एक हो। उक्त तालिम
          केन्द्रले पश्चिमान्चल विकास क्षेत्र अन्तर्गतका १६ जिल्लाहरुबाट कृषकहरु
          तथा पशु सेवा र पशु स्वास्थ्य क्षेत्रमा कार्यरत निजी तथा सरकारी सहायक
          स्तरका प्राविधिक कर्मचारीहरुलाई पशु सेवा प्रविधि सम्वन्धी ज्ञान, सीप
          तथा क्षमतामा अभिवृद्धि गर्न विभिन्न विषयगत तालिमहरु संचालन गर्दै
          आईरहेको थियो। यसका साथै तालिम केन्द्रले अन्य सरकारी तथा गैरसरकारी
          निकायहरुसँग समन्वय गरी तालिमहरु संचालन गर्ने तथा यस्ता निकायद्वारा
          संचालित तालिमहरुको अनुगमन र मुल्यांकन समेत गर्ने गर्दथ्यो। नेपालको
          संविधान २०७२ अनुसार संघियता कार्यान्वयन संगै विगतको क्षेत्रिय पशु सेवा
          तालिम केन्द्र हाल गण्डकी प्रदेशको भूमि व्यवस्था, कृषि तथा सहकारी
          मन्त्रालय माताहतको पशुपन्छी तथा मत्स्य सम्बन्धि कृषक÷व्यवसायि,
          प्राविधिक र अधिकृतस्तरका विभिन्न तालिम कार्यक्रमहरु संचालन गर्ने
          निकायको रुपमा पशु सेवा तालिम केन्द्रमा रुपान्तरण गरियो। यस पशु सेवा
          तालिम केन्द्रको कार्यालय माननिय मुख्यमन्त्री श्री पृथ्बी सुब्बा
          गुरुङ्गज्यूबाट २०७५साल भाद्र १२ गते समुद्‌घाटन भई आफ्ना कायक्रमहरु
          संचालन गर्दै आईरहेको छ।
        </div>
      </div>
    );
  }
}

export default Home;
