import React, { Component } from "react";

export class Aim extends Component {
  render() {
    return (
      <div className="content">
        <div className="titlebar">उदेश्य</div>
        <div className="card">
          पशुपन्छी तथा मत्स्य विकासको माध्यमबाट स्वरोजगार प्रबद्र्धन र आयआर्जनका
          वैकल्पिक अवसरहरु श्रृजना गरी कृषक समूदायको गरिवी न्यूनिकरण, पारिवारिक
          पोषण र जिवनस्तरमा सुधार गर्दै व्यावसायिकरण, उत्पादन विविधिरण, बजारीकरण
          लक्षित रणनीति अख्तियार गरी उद्यमशीलताको प्रबद्र्धन र पशुपन्छी तथा
          मत्स्यजन्य उत्पादनमा प्रादेशिक आत्मनिर्भरता हासिल गर्दै आयात
          प्रतिस्थापन र निर्यात प्रबद्र्धनमा टेवा पुर्याउने ।
        </div>
      </div>
    );
  }
}

export default Aim;
